# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [11,11, 19,27, 57,33]  #P2/4
  - [43,94, 118,80, 109,162]  # P3/8
  - [141,301, 258,245, 425,200]  # P4/16
  - [342,370, 259,570, 604,414]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Conv, [ 64, 6, 2, 2, 1, True, 1.0 ] ],                      # 0-P1/2
    [ -1, 1, Conv, [ 128, 3, 2, None, 1, True, 1.0 ] ],                  # 1-P2/4
    [ -1, 3, C3_prune, [ 128, True, 1, [ 0.5, 0.5 ], [ 1.0, 1.0, 1.0 ], 1.0 ] ],   # [cv1, cv2], [bottle-cv1, ..., bottlen-cv1], cv3
    [ -1, 1, Conv, [ 256, 3, 2, None, 1, True, 1.0 ] ],                  # 3-P3/8
    [ -1, 6, C3_prune, [ 256, True, 1, [ 0.5, 0.5 ], [ 1.0, 1.0, 1.0, 1.0, 1.0, 1.0 ], 1.0 ] ],
    [ -1, 1, Conv, [ 512, 3, 2, None, 1, True, 1.0 ] ],                  # 5-P4/16
    [ -1, 9, C3_prune, [ 512, True, 1, [ 0.5, 0.5 ], [ 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0 ], 1.0 ] ],
    [ -1, 1, Conv, [ 1024, 3, 2, None, 1, True, 1.0 ] ],                 # 7-P5/32
    [ -1, 3, C3_prune, [ 1024, True, 1, [ 0.5, 0.5 ], [ 1.0, 1.0, 1.0 ], 1.0 ] ],
    [ -1, 1, SPPF_prune, [ 1024, 5, 0.5 ] ],                                   # 9
  ]

# YOLOv5 v6.0 head with (P2, P3, P4, P5) outputs
head:
  [ [ -1, 1, Conv, [512, 1, 1, None, 1, True, 1.0] ],
    [-1, 1, DWContrans2d, [512,4,2,1,0]],
   [[-1, 6], 1, FRM, [512, 512, 1]],  # cat backbone P4
#    [ [ -1, 6 ], 1, Concat, [ 1 ] ],
    [-1, 3, C3_prune, [512, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0]],  # 13

    [ -1, 1, Conv, [ 256, 1, 1, None, 1, True, 1.0] ],
    [-1, 1, DWContrans2d, [256,4,2,1,0]],
   [[-1, 4], 1, FRM, [256,256,1]],  # cat backbone P3
    [ -1, 3, C3_prune, [ 256, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0]],  # 17 (P3/8-small)

    [ -1, 1, Conv, [ 128, 1, 1, None, 1, True, 1.0 ] ],
    [-1, 1, DWContrans2d, [128,4,2,1,0]],
   [[-1, 2], 1, FRM, [128,128,1]],  # cat head P4
    [ -1, 1, C3_prune, [ 128, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0] ],  # 21 (P4/16-medium)

    [ -1, 1, Conv, [ 128, 3, 2, None, 1, True, 1.0 ] ],
    [[-1, 18], 1, FRM, [128, 128, 1]],  # cat head P5
    [-1, 3, C3_prune, [256, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0]],  # 24 (P3/8-small)

    [ -1, 1, Conv, [ 256, 3, 2, None, 1, True, 1.0 ] ],
    [[-1, 14], 1, FRM, [256,256,1]],  # cat head P4
    [ -1, 3, C3_prune, [ 512, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0] ],  # 27 (P4/16-medium)

    [ -1, 1, Conv, [ 512, 3, 2, None, 1, True, 1.0 ] ],
    [[-1, 10], 1, FRM, [512,512,1]],  # cat head P5
    [ -1, 3, C3_prune, [ 1024, False, 1, [0.5, 0.5], [1.0, 1.0, 1.0], 1.0] ],  # 30 (P5/32-large)

    [ [ 21, 24, 27, 30 ], 1, Detect, [ nc, anchors ] ],  # Detect(P2, P3, P4, P5)
  ]